
/**
 * 一、
 * 1 - 5: B D D A C
 * 6- 10: B D A A D
 * 11-15: D C D C A
 * 16-18: D B C
 * # 最多错两个
 * 
 * 二、
 * 1. 
 * 2. 
 * 3. f // \0后面的不输出
 * 4. *p1++   *p2
 * 5. 60
 * 6. 21
 * 7. 1,2,2,1
 * 8. 45
 * 9. 0
 * 10. 8
 * 11. 8
 * 12. 11,11,11,12,12,20,20,20
 * 13. 6 10
 * 14. 4, 12
 * 15. 
 * 
 * 
 * 三、
 * 1. e,C,B,e
 * 2. 3
 * 3. 
 * 
 * 
 * 四、
 * 1.
 * 2. （1）
 *    （2）指向一维数组的指针，数组有四个整型元素
 *    （3）定义了一个指针数组，数组中有四个指针变量，每个指针都是用来存放整形数据的数组。
 *    （4）指向指针的指针。
 *    （5）指向函数的指针
 * 3. 
 * 
 * 4. 
 * 
 * 5. 算法：解决问题的邮箱步骤和方法
 *      有穷性，确定性，有效性，有0个或多个输入，有一个或多个输出
 * 6. 顺序，选择循环
 *      编辑，编译，连接，运行
 * 7. 
 * 
 * 五、
 * 1. 
 */

/**
 * 15、malloc 分配小空间，calloc 分配大空间
 * 
 */

